app/controllers/instances_controller.rb

SELECT  "products".* FROM "products"  WHERE "products"."id" = $1 LIMIT 1  [["id", 40]]
SELECT "ingredient_products".* FROM "ingredient_products"  WHERE "ingredient_products"."product_id" = '40' AND "ingredient_products"."ingredient_id" = '2'
INSERT INTO "instances" ("created_at", "ingredient_id", "instance_date", "product_id", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2015-06-12 21:14:58.728579"], ["ingredient_id", 1], ["instance_date", "2015-06-12 21:14:58.724037"], ["product_id", 5], ["updated_at", "2015-06-12 21:14:58.728579"]]
---
	def create
		@instance =Instance.new
		@instance.instance_date = Time.now
		@ingredient_product = IngredientProduct.where({product_id: params[:product_id], ingredient_id: params[:ingredient_id]} ).take
		@instance.ingredients_products_id = @ingredient_product.id

		if @instance.save