app/controllers/products_controller.rb

	def index
		@products = Product.all.order(created_at: :desc)
---
SELECT "products".* FROM "products"   ORDER BY "products"."created_at" DESC

	def create
		@product = Product.new(product_params)
		@product.ingredients = Ingredient.all

		@product.product_name = @product.product_name.downcase
		if @product.save
---
SELECT "ingredients".* FROM "ingredients"
INSERT INTO "products" ("created_at", "product_name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2015-06-01 01:24:41.357060"], ["product_name", "test"], ["updated_at", "2015-06-01 01:24:41.357060"]]

	def update
		@product = Product.find(params[:id])
		# downcase username when edited so it is stored in lowercase
		#   this makes the username case insensitve
		@product.product_name = @product.product_name.downcase
		if @product.update_attributes(product_params)
---
SELECT  "products".* FROM "products"  WHERE "products"."id" = $1 LIMIT 1  [["id", 5]]
UPDATE "products" SET "product_name" = $1, "updated_at" = $2 WHERE "products"."id" = 5  [["product_name", "Tony"], ["updated_at", "2015-06-03 19:33:04.513253"]]

	def destroy
		@product = Product.find(params[:id])
		# find all existing items user created and delete them as part of
		#    deleting the user
		if @product.destroy
---
SELECT  "products".* FROM "products"  WHERE "products"."id" = $1 LIMIT 1  [["id", 4]]
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 4]]