app/views/products/show.html.erb

SELECT "ingredients".* FROM "ingredients" INNER JOIN "ingredients_products" ON "ingredients_products"."ingredient_id" = "ingredients"."id" INNER JOIN "products" ON "products"."id" = "ingredients_products"."product_id" WHERE (product.id = NULL)
---
				<div class="page-subtitle">ingredients</div>
					<% @product.ingredients.unique.each do |ingredient| %>

SELECT  "instances".* FROM "instances"  WHERE "instances"."ingredient_id" = $1  ORDER BY "instances"."id" DESC LIMIT 1  [["ingredient_id", 1]]
---

							Last: <%= ingredient.instances.last.instance_date %>